Repository: winzter/UniHR
Catalog: lib/l10n/app_*.arb
Languages: th

source: Home
th: หน้าแรก

source: Timetable
th: ตารางเวลา

source: Leave
th: ลางาน

source: Profile
th: โปรไฟล์

source: Time Stamp
th: ลงเวลา

source: Request List
th: สถานะรายการ

# salarySlip
source: Pay Slip
th: สลิปเงินเดือน

source: Summary Time
th: สรุป OT และค่ากะ

source: Learning
th: อมรม

source: Travelling
th: บันทึกเดินทาง

source: Work Record
th: บันทึกทำงาน

source: Time Management
th: จัดการเวลาทำงาน

source: Hello
th: สวัสดี

source: Late
th: มาสาย

source: Absent
th: ขาดงาน

source: LeaveEarly
th: กลับก่อน

source: Deduction
th: เงินหักสุทธิ

# numberofvacation
source: Vacation days
th: จำนวนวันลาพักร้อน

# vacationRights
source: Vacation Quotas
th: สิทธิการลาพักร้อน

source: Agree
th: ตกลง

# error01
source: An error has occurred.
th: เกิดข้อผิดพลาด

# error_data01
source: Unable to retrieve data.
th: ไม่สามารถดึงข้อมูลได้

# error_inter
source: Check your internet or contact your admin.
th: ตรวจสอบอินเทอร์เน็ตของท่าน หรือ ติดต่อแอดมิน

source: january
th: มกราคม

source: february
th: กุมภาพันธ์

source: march
th: มีนาคม

source: april
th: เมษายน

source: may
th: พฤษภาคม

source: june
th: มิถุนาคม

source: july
th: กรกฎาคม

source: august
th: สิงหาคม

source: september
th: กันยายน

source: october
th: ตุลาคม

source: november
th: พฤศจิกายน

source: december
th: ธันวาคม

source: dear mr./ms.
th: เรียน คุณ

source: title
th: คำนำหน้า

# pleaseselecttitle
source: please select a title
th: กรุณาเลือกคำนำหน้า

# titleeng
source: title(english)
th: คำนำหน้า(อังกฤษ)

source: Full Name
th: ชื่อ-สกุล

source: type
th: ประเภท

source: day, month, year (ad)
th: วัน เดือน ปี(พ.ศ.)

# lastdayofmonth
source: last day of the month
th: วันสุดท้ายของเดือน

source: start
th: เริ่มต้น

source: full day
th: เต็มวัน

source: end
th: สิ้นสุด

source: create
th: สร้าง

source: date of creation
th: สร้างเมื่อ

source: description
th: เหตุผล

source: overtime
th: ทำงานล่วงเวลา

# lunchbreaktime
source: have a lunch break time
th: มีช่วงเวลาพักเที่ยง

# startworkingmonday
source: start working on monday
th: เริ่มทำงานวันจันทร์

source: top 5 ot over 36 hrs.
th: 5 อันดับ ทำงานล่วงเวลาเกิน 36 ชม.

source: no ot over 36 hrs.
th: ไม่มีการทำเกิน 36 ชม.

source: top 5 late
th: 5 อันดับมาสายสูงสุด

source: no late
th: ไม่มีพนักงานมาสาย

source: total pay
th: รวมรายจ่าย

source: request list history
th: ประวัติสถานะรายการ

source: request list
th: สถานะรายการ

# selectdate
source: select a date
th: เลือกวันที่

source: select year
th: เลือกปี

source: start date
th: วันที่เริ่มต้น

source: end date
th: วันที่สิ้นสุด

source: invalid start and enddates
th: วันที่เริ่ม และ สิ้นสุด ไม่ถูกต้อง

# startdatetravel
source: start date of travel
th: วันที่เริ่มเดินทาง

# enddatetravel
source: end date of travel
th: วันที่สิ้นสุดเดินทาง

# pleasespecifycorrectdate
source: please specify the correct date
th: กรุณาระบุวันที่ให้ถูกต้อง

# calculation
source: in the process of calculation
th: กำลังคำนวณ

source: inspection date
th: วันที่ตรวจสอบ

source: announcement date
th: วันที่ประกาศ

source: edit announcement
th: แก้ไขประกาศ

source: create announcement
th: สร้างประกาศ

source: company policy
th: หัวข้อประกาศ

source: policy name
th: ชื่อ policy

source: topic name
th: ชื่อหัวข้อที่

source: edited company policy
th: แก้ไข company policy

source: created company policy
th: สร้าง company policy

source: successfully edited company policy
th: แก้ไข company policy สำเร็จ

source: successfully created company policy
th: สร้าง company policy สำเร็จ

source: change cumulative success rate
th: เปลี่ยนแปลงอัตราสะสมสำเร็จ

source: change cumulative success rate unsuccessful
th: เปลี่ยนแปลงอัตราสะสมไม่สำเร็จ

source: delete successful beneficiary
th: ลบผู้ได้รับผลประโยชน์สำเร็จ

source: delete unsuccessful beneficiary
th: ลบผู้ได้รับผลประโยชน์ไม่สำเร็จ

source: last modified
th: แก้ไขเมื่อ

source: working time request
th: ขอรับรองเวลาทำงาน

source: working time request list
th: รายการขอรับรองเวลาทำงาน

source: compensate request
th: คำขอทำชั่วโมง compensate

source: leave request
th: คำขอลางาน

# requestvacationleave
source: vacation leave request
th: คำขอลาพักร้อน

# yourrequestapproved
source: your request for approval has been approved. please check.
th: คำขออนุมัติของท่านได้แล้วรับการอนุมติแล้ว กรุณาตรวจสอบ

source: shift request
th: ขอเปลี่ยนกะ

# searchemp
source: search employee
th: ค้นหาพนักงาน

# selectemp
source: select employee
th: เลือกพนักงาน

source: no data
th: ไม่พบข้อมูล

source: list
th: รายการ

source: reason
th: เหตุผล

source: note
th: หมายเหตุ

# measurementdata
source: the data used for measurement
th: ข้อมูลที่ใช้วัด

# objectivemeasurementdata
source: the objective of the data used for measurement
th: เป้าหมายของข้อมูลที่ใช้วัด

# typemeasurementdata
source: the type of data used for measurement
th: ประเภทข้อมูลที่ใช้วัด

source: unspecified reason
th: ไม่ระบุเหตุผล

source: manager lv.
th: หัวหน้างานระดับที่

source: in progress
th: กำลังดำเนินการ

source: successfully
th: ดำเนินการสำเร็จ

source: unsuccessful
th: ดำเนินการไม่สำเร็จ

source: approval history
th: ประวัติการอนุมัติ

source: transaction executor
th: ผู้ทำรายการ

source: approved
th: อนุมัติ

source: change
th: เปลี่ยน

# notapproved
source: rejected
th: ไม่อนุมัติ

source: approver
th: ผู้อนุมัติ

source: other request items
th: รายการคำขออื่น ๆ

source: reason for rejection
th: เหตุผลที่ไม่อนุมัติ

source: withdraw
th: ถอน

source: cancel transaction
th: ถอนรายการ

source: pending approval
th: รออนุมัติ

source: pending approval list
th: รายการที่รออนุมัติ

source: pending review
th: รอตรวจสอบ

source: manager
th: หัวหน้างาน

source: date
th: วันที่

source: day off
th: วันหยุด

source: search for holidays
th: ค้นหาวันหยุด

source: optional
th: ไม่บังคับ

source: cancel
th: ยกเลิก

source: cancel item
th: ยกเลิกรายการ

source: status
th: สถานะ

# cannotproceedtransactionastherearependingapprovalrequests
source: cannot proceed with the transaction as there are pending approval requests.
th: ไม่สามารถทำรายการได้ เนื่องจากมีรายการคำขอรออนุมัติค้างอยู่

# workforcemorethan50000people
source: it's not possible to allocate a workforce of more than 50,000 people.
th: ไม่สามารถกำหนดแผนกำลังพลเกิน 50,000 คนได้

# cannotsaveduplicatecode
source: cannot save due to duplicate item code
th: ไม่สามารถบันทึกได้เนื่องจากรหัสรายการซ้ำ

source: not less than
th: ไม่น้อยกว่า

source: not more than
th: ไม่เกิน

source: approved date
th: วันที่อนุมัติ

source: manager comment
th: เหตุผลหลังอนุมัติ

source: close
th: ปิด

source: auto close
th: ปิดอัตโนมัติ

source: previous
th: เดิม

# newss
source: new
th: ใหม่

source: replacement
th: ทดแทน

source: employee list
th: รายชื่อพนักงาน

source: employee status
th: สถานะพนักงาน

source: download
th: ดาวน์โหลด

source: upload
th: อัพโหลด

source: add employee
th: เพิ่มพนักงานใหม่

source: select upload item
th: เลือกรายการอัพโหลด

source: upload working hours
th: อัพโหลดเวลาทำงาน

source: saving data
th: กำลังบันทึกข้อมูล

# listempcantrecords
source: list of employees can't records
th: รายชื่อพนักงานที่ไม่สามารถบันทึกได้

source: download template
th: ดาวน์โหลดเทมเพลต

source: file
th: ไฟล์

source: various files
th: ไฟล์ต่าง ๆ

source: click select file
th: คลิ๊กเพื่อเลือกไฟล์

source: drag & drop or click select file
th: drag & drop หรือ คลิ๊กเพื่อเลือกไฟล์

# file_invalid_type
source: the file extension must be .jpeg, .jpg, or .png only
th: นามสกุลไฟล์ต้องเป็น .jpeg .jpg หรือ .png เท่านั้น

# file_too_large
source: the file size must not exceed 5 mb
th: ขนาดไฟล์ต้องไม่เกิน 5 mb

# too_many_files
source: you can select only up to 1 file
th: เลือกไฟล์ได้สูงสุด 1 ไฟล์เท่านั้น

# uploadimgsuccessfully
source: upload image successfully
th: เพิ่มรูปสำเร็จ

# uploadimgunsuccessfully
source: upload image unsuccessfully
th: เพิ่มรูปไม่สำเร็จ

source: file to upload
th: ไฟล์ที่อัปโหลด

source: no file uploaded
th: ไม่มีการอัปโหลดไฟล์

source: save
th: บันทึก

# uploadingimg
source: uploading image
th: กำลังอัพโหลดรูปภาพ

source: mr.
th: นาย

source: mrs.
th: นาง

source: miss
th: นางสาว

source: first name
th: ชื่อ

source: last name
th: นามสกุล

# firstnameeng
source: first name(english)
th: ชื่อ(อังกฤษ)

# lastnameeng
source: last name(english)
th: นามสกุล(อังกฤษ)

source: nickname
th: ชื่อเล่น

# nicknameeng
source: nickname(english)
th: ชื่อเล่น(อังกฤษ)

source: working days
th: จำนวนวันทำงาน

source: leave early
th: กลับก่อน

# leaveexceptvacation
source: leave (except vacation leave, alternating holidays)
th: ลา (ยกเว้น ลาพักร้อน, ลาสลับวันหยุด)

source: normal
th: ปกติ

# empdiligenceallowed
source: list of employees who receive diligence allowance
th: รายชื่อพนักงานที่ได้รับเบี้ยขยัน

# normalemp
source: employees
th: พนักงานปกติ

# empout
source: resigned employees
th: พนักงานลาออก

source: hide search
th: ซ่อนค้นหา

source: search more
th: ค้นหาเพิ่มเติม

source: search manager
th: ค้นหาหัวหน้างาน

source: select manager
th: เลือกหัวหน้างาน

source: company
th: บริษัท

source: company information
th: ข้อมูลบริษัท

source: code
th: รหัส

source: company code
th: รหัสบริษัท

source: all company
th: บริษัททั้งหมด

source: division
th: ฝ่าย

source: all division
th: ฝ่ายทั้งหมด

source: all department
th: หน่วยงานทั้งหมด

source: all section
th: แผนกทั้งหมด

source: position
th: ตำแหน่ง

source: all position
th: ตำแหน่งทั้งหมด

source: email
th: อีเมล์

source: company email
th: email บริษัท

# loadingempdata
source: loading employee data
th: กำลังโหลดข้อมูลพนักงาน

source: no employee
th: ไม่พบพนักงาน

source: edit data
th: แก้ไขข้อมูล

source: add data
th: เพิ่มข้อมูล

source: general information
th: ข้อมูลทั่วไป

source: edit general information
th: แก้ไขข้อมูลทั่วไป

source: edit data address
th: แก้ไขข้อมูลที่อยู่

# selectbank
source: --selct bank--
th: --เลือกธนาคาร--

source: edit data bank
th: แก้ไขข้อมูลธนาคาร

source: edit contact information
th: แก้ไขข้อมูลการติดต่อ

source: edit emergency contact information
th: แก้ไขข้อมูลผู้ติดต่อฉุกเฉิน

source: additional data
th: ข้อมูลเพิ่มเติม

source: personal data
th: ข้อมูลพื้นฐาน

source: change data
th: เปลี่ยนแปลงข้อมูล

source: employee info
th: ประวัติพนักงาน

source: no secret
th: ไม่มีความลับ

source: personal info
th: ข้อมูลส่วนตัว

source: family info
th: ข้อมูลครอบครัว

source: work info
th: ข้อมูลงาน

source: payment info
th: ข้อมูลการจ่าย

source: desired qualifications
th: คุณสมบัติที่ต้องการ

# numberjobopenings
source: number of job openings
th: จำนวนเปิดรับสมัคร

source: closing date
th: วันที่ปิดรับสมัคร

source: opening date
th: วันที่เปิดรับสมัคร

source: application closed
th: ปิดรับสมัคร

source: education
th: การศึกษา

source: primary education
th: ประถมศึกษา

source: secondary education
th: มัธยมศึกษา

source: junior high school education
th: มัธยมศึกษาตอนต้น

source: senior high school education
th: มัธยมศึกษาตอนปลาย

source: vocational certificate
th: ปวช.

source: certificate of technical vocation
th: ปวส.

source: bachelor degrees
th: ปริญญาตรี

source: master degrees
th: ปริญญาโท

source: doctor degrees
th: ปริญญาเอก

source: work experience
th: ประสบการณ์ทำงาน

source: career path
th: สายงาน

source: my career path
th: สายงานอาชีพของฉัน

source: recommended career path
th: สายงานที่แนะนำ

source: interested career path
th: สายงานที่สนใจ

source: interested career path ranking
th: สายงานที่สนใจอันดับที่

# recommendcareerranking
source: recommend a career ranking
th: แนะนำสายงานอันดับที่

source: strength
th: จุดแข็ง

# weakness
source: weaknesses
th: จุดอ่อน

source: provident fund
th: กองทุนสำรองเลี้ยงชีพ

source: performance
th: ผลงาน

source: additions payment
th: รายการจ่ายเพิ่ม

source: regular deduction
th: หักเงินประจำ

source: setup salary calculation
th: ตั้งค่าคำนวณเงินเดือน

source: income certificate
th: หนังสือรับรองเงินเดือน

source: employment certificate
th: หนังสือรับรองการทำงาน

source: tawi
th: ทวิ

source: reset password
th: รีเซ็ตรหัสผ่าน

source: transfer
th: โอน/ย้าย

source: employment type
th: ประเภทการจ้าง

# hiresubstitute
source: hire a substitute
th: จ้างทดแทน

# systemdetectednationalidcardrehiringsameemp
source: the system detected that this national id card number is rehiring the same employee once again.
th: ระบบตรวจพบเลขบัตรประจำตัวประชาชนนี้เป็นการจ้างพนักงานคนเดิมใหม่อีกรอบ

source: level
th: ระดับ

source: wages
th: ค่าจ้าง

# wageaafterdeducting
source: wage (after deducting for late/early leave/absence)
th: ค่าจ้าง(หลังหักมาสาย/กลับก่อน/ขาดงาน)

source: probation
th: ทดลองงาน

source: terminated
th: ลาออก

source: nationality
th: สัญชาติ

source: marital status
th: สถานภาพ

source: single
th: โสด

source: married
th: สมรส

source: widowed
th: หม้าย

source: divorced
th: หย่า

source: passport number
th: เลขหนังสือเดินทาง

source: car mileage
th: ไมล์รถ

source: work permit number
th: เลขใบอนุญาตทำงาน

source: address
th: ที่อยู่

source: house no.
th: บ้านเลขที่

source: village
th: หมู่บ้าน

source: village no.
th: หมู่ที่

source: alley
th: ตรอก/ซอย

source: road
th: ถนน

source: sub district
th: ตำบล

source: district
th: เขต/อำเภอ

source: province
th: จังหวัด

source: area code
th: รหัสไปรษณีย์

source: contact
th: การติดต่อ

source: contact name
th: ชื่อผู้ติดต่อ

source: primary contact
th: ผู้ติดต่อหลัก

source: emergency contact
th: ผู้ติดต่อฉุกเฉิน

source: emergency contact number
th: เบอร์ผู้ติดต่อฉุกเฉิน

# emergencyphone
source: emergency phone number
th: เบอร์ติดต่อ

# companyphone
source: company phone number
th: เบอร์โทรศัพท์บริษัท

source: edit contact
th: แก้ไขการติดต่อ

# emergencyrelationship
source: relationship
th: ความสัมพันธ์

source: criminal image
th: ประวัติอาชญากรรม

source: thai
th: ไทย

source: edit address
th: แก้ไขที่อยู่ปัจจุบัน

source: edit emergency contact
th: แก้ไขผู้ติดต่อฉุกเฉิน

source: edit personal info
th: แก้ไขข้อมูลส่วนตัว

source: editcriminalimage
th: แก้ไขประวัติอาชญากรรม

# savedata
source: save
th: บันทึกข้อมูล

source: all location (coordinates)
th: ทุกสถานที่ (จับพิกัด)

source: one main working point
th: จุดทำงานหลักที่เดียว

source: all working point
th: ทุกจุดทำงานที่บริษัทกำหนด

source: date entry
th: วันที่เข้างาน

source: contract renewal date
th: วันต่อสัญญา

source: job description
th: รายละเอียดงาน

source: job group
th: กลุ่มงาน

source: job level
th: ระดับงาน

source: employment time
th: รูปแบบงาน

# variousstatusformats
source: status formats
th: รูปแบบสถานะต่าง ๆ

source: field office
th: ประเภทงาน

source: method attendance
th: วิธีการบันทึกเวลา

source: gps location work
th: ที่ทำงานหลัก

source: finger scan
th: การบันทึกเวลา

source: record start-end travel time
th: บันทึกเวลาเริ่ม-สิ้นสุดเดินทาง

source: timekeeping affects salary
th: การบันทึกเวลามีผลต่อเงินเดือน

source: yes
th: ใช่

source: no
th: ไม่ใช่

source: manager info
th: ข้อมูลหัวหน้างาน

# no_number
source: no.
th: ลำดับที่

source: manager group
th: กลุ่มหัวหน้างาน

# workinglocationplace
source: working location
th: สถานที่ทำงาน

# methodattendancespot
source: method attendance
th: จุดบันทึกเวลา

source: main location
th: ที่ทำงานหลัก

source: all location
th: ทุกสถานที่

source: gps point
th: พิกัด

source: edit manager info
th: แก้ไขข้อมูลหัวหน้างาน

source: edit work info
th: แก้ไขข้อมูลงาน

source: no working hours
th: ไม่กำหนดเวลาทำงาน

# workingtimeinfo
source: working time information
th: ข้อมูลเวลาทำงาน

source: working type
th: ประเภทเวลางาน

source: shift group
th: ประเภทกะ

source: shift name
th: ชื่อกะ

source: add shift
th: เพิ่มกะ

source: number of shifts
th: จำนวนชุดกะ

source: save shift schedule
th: บันทึกตารางกะ

# workingtimeperday
source: workingtime/day
th: เวลาทำงานต่อวัน

source: time in
th: เวลาเข้า

source: time out
th: ออกงาน

source: change payment
th: ปรับค่าจ้าง

source: payment type
th: ประเภทค่าจ้าง

source: salary
th: ค่าจ้าง

source: per month
th: ต่อเดือน

source: payment round
th: รอบการจ่าย

# bankinfo
source: bank information
th: ข้อมูลธนาคาร

source: bank name
th: ชื่อธนาคาร

source: bangkok bank
th: ธนาคารกรุงเทพ

source: krung thai bank
th: ธนาคารกรุงไทย

source: bank of ayudhya
th: ธนาคารกรุงศรีอยุธยา

source: kasikorn bank
th: ธนาคารกสิกรไทย

source: tmb thanachart bank
th: ธนาคารทหารไทยธนชาต

source: siam commercial bank
th: ธนาคารไทยพาณิชย์

source: cimb thai bank
th: ธนาคารซีไอเอ็มบี ไทย

source: union overseas bank
th: ธนาคารยูโอบี

source: branch name
th: สาขา

source: book id
th: หมายเลขบัญชี

source: account name
th: ชื่อบัญชี

source: branch address
th: ที่อยู่สาขา

source: bank file
th: ไฟล์ธนาคาร

source: for bank file
th: สำหรับออกไฟล์ธนาคาร

source: report bank id
th: รหัสธนาคาร

source: report bank name
th: ชื่อผู้รับเงิน

source: report bank ref.
th: เลขที่อ้างอิง

source: percentage rate
th: อัตราร้อยละ

source: this field is required
th: โปรดกรอกข้อมูล

# pleaseenterinformationrank
source: please enter information for rank
th: กรุณาใส่ข้อมูลอันดับที่

source: please enter your response
th: กรุณากรอกคำตอบ

source: please enter your first name
th: กรุณากรอกชื่อจริง

source: please enter your last name
th: กรุณากรอกนามสกุล

# pleaseenterrelationship
source: please enter the relationship
th: กรุณากรอกความสัมพันธ์

# pleaseenterpercentagerate
source: please enter the percentage rate
th: กรุณากรอกอัตราร้อยละ

# choosereason
source: choose a reason
th: เลือกเหตุผล

# pleaseentercareerfield
source: please enter the career field
th: กรุณาใส่สายงาน

# pleaseselectreason
source: please select a reason
th: กรุณาเลือกเหตุผล

# pleaseenternumber
source: please enter a number
th: กรุณากรอกตัวเลข

# pleaseselectnewcumulativerate
source: please select a new cumulative rate
th: กรุณาเลือกอัตตราสะสมใหม่

# pleaseentercarmileage
source: please enter the car mileage
th: กรุณากรอกไมล์รถ

# pleaseenterinterviewstarttime
source: please enter the interview start time
th: กรุณากรอกเวลาเริ่มต้นสัมภาษณ์

# pleaseenterinterviewendtime
source: please enter the interview end time
th: กรุณากรอกเวลาสิ้นสุดสัมภาษณ์

# pleaseenterindividualinterviewtime
source: please enter the individual interview time
th: กรุณากรอกเวลาสัมภาษณ์รายคน

# pleaseenterformat
source: please enter the format
th: กรุณากรอกเลือกรูปแบบ

# interviewlocationlessthan350
source: the interview location must be less than 350 characters long
th: สถานที่สัมภาษณ์ต้องมีความยาวน้อยกว่า 350 ตัวอักษร

# contactnamelessthan200
source: the contact name must be less than 200 characters long
th: ชื่อผู้ติดต่อต้องมีความยาวน้อยกว่า 200 ตัวอักษร

# pleaseentercorrectquantity
source: please enter the correct quantity
th: กรุณากรอกจำนวนให้ถูกต้อง

source: invalid date and time input
th: กรอกวันที่และเวลาไม่ถูกต้อง

# pleaseenterrequiredinformationcompletely
source: please enter the required information completely and accurately
th: กรุณากรอกข้อมูลที่จำเป็นให้ครบถ้วนและถูกต้อง

# pleaseenternationalidcardnumber
source: please enter a 13-digit national id card number
th: โปรดกรอกเลขบัตรประชาชน 13 หลัก

# nationalidcardnumberduplicated
source: national id card number is duplicated in the system
th: เลขบัตรประจำตัวประชาชนซ้ำกับในระบบ

# pleaseenterphonenumber
source: please enter a 10-digit phone number
th: โปรดกรอกเบอร์โทร 10 หลัก

# length4_6characters
source: a length of 4-6 characters
th: ความยาว 4-6 ตัว

# atleast8_16charactersenglishandnumbers
source: at least 8-16 characters of english letters and numbers
th: อย่างน้อย 8-16 ตัวอักษรภาษาอังกฤษและตัวเลข

# passwordatleast1numericdigit
source: the password must include at least 1 numeric digit
th: รหัสผ่านต้องมีตัวเลขอย่างน้อย 1 ตัว

# passwordenglishornumbersonly
source: the password must consist of english letters or numbers only
th: รหัสผ่านต้องเป็นตัวอักษรภาษาอังกฤษหรือตัวเลขเท่านั้น

# passwordatleast1englishletter
source: the password must have at least 1 english letter
th: รหัสผ่านต้องมีตัวอักษรภาษาอังกฤษอย่างน้อย 1 ตัว

# doesnotmatchnewpassword
source: does not match the new password
th: ไม่ตรงกับรหัสผ่านใหม่

# duplicatedata
source: duplicate data with another entry
th: ข้อมูลซ้ำกับรายการอื่น

# endtimegreaterthanstarttime
source: the end time must be greater than the start time
th: เวลาสิ้นสุดต้องมากกว่าเวลาเริ่มต้น

source: invalid phone number
th: เบอร์โทรศัพท์ไม่ถูกต้อง

source: current password
th: รหัสผ่านปัจจุบัน

source: new password
th: รหัสผ่านใหม่

source: confirm new password
th: ยืนยันรหัสผ่านใหม่

source: confirm password change
th: ยืนยันเปลี่ยนรหัสผ่านใหม่

# pleaseselecttypeofrequest
source: please select the type of request
th: กรุณาเลือกประเภทคำขอ

# emailduplicated
source: email is duplicated in the system
th: อีเมลซ้ำกับในระบบ

# editbankinfo
source: edit bank information
th: แก้ไขข้อมูลธนาคาร

source: book bank
th: ธนาคาร

source: report to bank
th: รายงานส่งธนาคาร

# educationinfo
source: Education information
th: ประวัติการศึกษา

source: add education
th: เพิ่มประวัติการศึกษา

# noeducationinfo
source: no education information
th: ไม่มีข้อมูลประวัติการศึกษา

source: not specified school
th: ไม่ระบุสถานศึกษา

source: add work experience
th: เพิ่มประสบการณ์ทำงาน

source: no work experience
th: ไม่มีข้อมูลประสบการณ์ทำงาน

source: edit education
th: แก้ไขประวัติการศึกษา

source: education degree
th: ระดับการศึกษา

source: minimum education degree
th: ระดับการศึกษาขั้นต่ำ

source: university
th: มหาวิทยาลัย

source: faculty
th: คณะ

source: major
th: สาขาวิชา

source: gpa
th: เกรดเฉลี่ย

source: are you sure
th: คุณแน่ใจใช่ไหม?

source: confirm delete
th: ยืนยันลบ

source: edit work experience
th: แก้ไขประสบการณ์ทำงาน

source: position name
th: ชื่อตำแหน่งงาน

source: job transfer
th: โอนย้ายตำแหน่งงาน

source: adjust employeelevel
th: ปรับระดับพนักงาน

source: adjust salary
th: ปรับค่าจ้าง

# jobtransferor
source: do you want to transfer to another position?
th: ต้องการโอนย้ายตำแหน่งงานหรือไม่ ?

# adjustemployeelevelor
source: do you want to adjust the employee's level?
th: ต้องการปรับระดับพนักงานหรือไม่ ?

# adjustsalaryor
source: do you want to adjust the salary?
th: ต้องการปรับค่าจ้างหรือไม่ ?

source: want
th: ต้องการ

source: do not want
th: ไม่ต้องการ

source: company name
th: ชื่อบริษัท

source: company name (abbreviation)
th: ชื่อบริษัท(ย่อ)

source: company name (english)
th: ชื่อบริษัท(อังกฤษ)

source: descriptions
th: รายละเอียด

source: view descriptions
th: ดูรายละเอียด

source: inspection details
th: รายละเอียดการตรวจสอบ

source: latest year evaluation results
th: ผลประเมินปีล่าสุด

source: evaluate work over the past 5 years
th: ประเมินผลงานย้อนหลัง 5 ปี

source: all performance
th: ผลงานทั้งหมด

source: no performance
th: ไม่มีข้อมูลผลประเมิน

source: edit performance
th: แก้ไขผลงาน

source: performance year
th: ผลงานปี

source: leave date
th: วันที่ลา

# leaves
source: Leave
th: การลางาน

# leavesbelowminimumrequirement
source: the number of leave days is below the minimum requirement.
th: จำนวนการลาไม่ถึงขั้นต่ำที่กำหนด

source: sick leave
th: ลาป่วย

source: personal leave
th: ลากิจ

source: vacation leave
th: ลาพักร้อน

source: other leave
th: ลาอื่น ๆ

source: leave type
th: ประเภทการลา

source: select leave type
th: เลือกประเภทการลา

# leaverights
source: leave quota
th: สิทธิการลา

# allleaverights
source: all leave quotas
th: สิทธิการลาทั้งหมด

source: work leave calendar
th: ปฏิทินการลางาน

source: leave record
th: ประวัติ

source: no leave record
th: ไม่มีประวัติการลางาน

# accumulatedrights
source: accumulated quota
th: สิทธิสะสม

source: spent
th: ใช้ไป

source: remaining
th: คงเหลือ

source: unlimited
th: ไม่จำกัด

source: edit family member
th: แก้ไขสมาชิกครอบครัว

# editleaverights
source: edit leave quotas
th: แก้ไขสิทธิการลา

# editaccumulatedrights
source: edit accumulated quotas
th: แก้ไขสิทธิสะสม

source: modification
th: การเปลี่ยนแปลง

source: save changes
th: บันทึกการเปลี่ยนแปลง

source: date modified
th: วันที่แก้ไขข้อมูล

source: edit transfer data
th: แก้ไขข้อมูลโอนย้าย

source: currently data
th: ข้อมูลปัจจุบัน

source: new position
th: ตำแหน่งใหม่

source: please select company
th: โปรดเลือกบริษัท

source: effective data
th: วันที่มีผล

source: employee position
th: ตำแหน่งพนักงาน

source: probation result
th: ผลทดลองงาน
