Repository: winzter/UniHR
Catalog: lib/l10n/app_*.arb
Languages: th

source: summary of trial work
th: สรุปผลทดลองงาน

source: passed probation
th: ผ่านการทดลองงาน

source: not passed probation
th: ไม่ผ่านการทดลองงาน

source: assessor
th: ผู้ประเมิน

source: edit probation result
th: แก้ไขผลการทดลองงาน

source: current
th: ปัจจุบัน

source: edit salary
th: แก้ไขข้อมูลค่าจ้าง

source: current data
th: ข้อมูลปัจจุบัน

source: annual adjustment
th: ปรับประจำปี

source: restructure
th: ปรับโครงสร้าง

source: adjust position
th: ปรับตำแหน่ง

source: adjust job level
th: ปรับระดับงาน

source: adjust special
th: ปรับพิเศษ

source: adjusted other reasons
th: ปรับด้วยเหตุผลอื่นๆ

source: other
th: อื่น ๆ

source: contract end date
th: วันที่สิ้นสุดสัญญา

source: reason other
th: เหตุผล(เพิ่มเติม)

source: edit resign info
th: แก้ไขข้อมูลลาออก

source: add resign info
th: เพิ่มข้อมูลลาออก

source: contract expire
th: หมดสัญญา

source: got new job
th: ได้งานใหม่

source: new job
th: งานใหม่

source: replace existing employee
th: ทดแทนพนักงานเดิม

source: personal business
th: ทำธรุกิจส่วนตัว

source: personalreason
th: เหตุผลส่วนตัว

source: giveout
th: ให้ออก

source: income list
th: รายการเงินได้

source: additional name
th: ชื่อรายการ

source: quantity
th: จำนวน

source: deduction list
th: รายการเงินหัก

source: deduction name
th: ชื่อรายการ

source: Password
th: รหัสผ่าน

source: change password
th: เปลี่ยนรหัสผ่าน

source: connection
th: การเชื่อมต่อ

source: resetconnection
th: รีเซ็ตการเชื่อมต่อ

source: no connection
th: ยังไม่ได้เชื่อมต่อ

source: confirm
th: ยืนยัน

source: service date in fund
th: วันที่นับอายุงานในกองทุน

source: fund entry date
th: วันที่เข้ากองทุน

source: accumulated rate
th: อัตราสะสม

source: employee section
th: ส่วนพนักงาน

source: contribution company
th: สมทบส่วนบริษัท

source: current accumulated rate
th: อัตตราสะสมปัจจุบัน

source: new accumulated rate
th: อัตตราสะสมใหม่

source: beneficiary
th: ผู้รับผลประโยชน์

source: unsuccessful beneficiary
th: ผู้ได้รับผลประโยชน์ไม่สำเร็จ

source: edit beneficiary
th: แก้ไขผู้รับผลประโยชน์

source: add beneficiary
th: เพิ่มผู้รับผลประโยชน์

source: no beneficiary
th: ไม่มีรายชื่อผู้รับผลประโยชน์

source: confirm to delete
th: ยืนยันการลบ

source: confirm cumulative rate change
th: ยืนยันการเปลี่ยนอัตราสะสม

# thechangecumulativeratewilleffectthismonth
source: the change in the cumulative rate will take effect this month
th: การเปลี่ยนอัตราสะสมจะเริ่มใช้ในเดือนนี้

source: employee id
th: รหัสพนักงาน

source: edit employment type
th: แก้ไขประเภทการจ้าง

source: new employment type
th: ประเภทการจ้างใหม่

source: personal level change
th: ปรับระดับ

source: level group
th: กลุ่มระดับ

source: no data change
th: ไม่มีการเปลี่ยนแปลง

source: edit personal level
th: แก้ไขระดับ

source: new level
th: ระดับใหม่

source: employee personal level
th: ระดับพนักงาน

source: new employee level
th: ระดับพนักงานใหม่

source: add family member
th: เพิ่มสมาชิกครอบครัว

source: family member no.
th: สมาชิกครอบครัวคนที่

source: relationship
th: ความสัมพันธ์

source: spouse
th: คู่สมรส

source: child
th: บุตร

source: father
th: บิดา

source: mother
th: มารดา

source: personal id
th: เลขบัตรประชาชน

source: birth date
th: วันเกิด

source: no family member
th: ไม่มีข้อมูลสมาชิกครอบครัว

source: family member
th: สมาชิกครอบครัว

source: daily shift change
th: เปลี่ยนกะรายวัน

source: salary payment
th: รอบจ่ายเงินเดือน

source: calculate salary
th: คำนวณเงินเดือน

# calculateprovidentfund
source: Cumulative provident fund
th: กองทุนสำรองเลี้ยงชีพ สะสม

source: tax id number
th: เลขผู้เสียภาษี

source: tax
th: ภาษี

source: income tax
th: ส่วนภาษีเงินได้

source: calculate income tax
th: คำนวณภาษีเงินได้

source: paying income tax
th: การจ่ายภาษีเงินได้

source: employeepayincometax
th: พนักงานจ่ายภาษีเงินได้

source: company pay income tax
th: บริษัทจ่ายภาษีเงินได้

source: income under section
th: เงินได้ตามมาตรา

source: not specified
th: ไม่ระบุ

source: sso
th: ส่วนประกันสังคม

source: p.n.d. 1
th: ภ.ง.ด. 1

source: p.n.d. 91
th: ภ.ง.ด. 91

source: calculate sso
th: คำนวณประกันสังคม

source: setting salary
th: ตั้งค่าการทำเงินเดือน

source: time management
th: การจัดการเวลา

source: daily information
th: ข้อมูลรายวัน

source: weekly information
th: ข้อมูลรายสัปดาห์

source: monthly information
th: ข้อมูลรายเดือน

source: personal information
th: ข้อมูลรายบุคคล

source: shift schedule
th: ตารางกะ

source: leave not found
th: ไม่พบการลา

source: search date
th: วันที่ค้นหา

source: Clock in
th: ลงชื่อเข้างาน

source: Clock out
th: ลงชื่อออกงาน

source: working day
th: วันที่ทำงาน

source: working time
th: ขอรับรองเวลา

source: annual holiday
th: วันหยุดประจำปี

source: request type
th: ประเภท

source: overtime request
th: คำขอทำงานล่วงเวลา

# periodtime
source: period
th: ช่วงเวลา

source: editable period
th: ช่วงที่สามารถแก้ไข

source: start time
th: เวลาเริ่มต้น

source: end time
th: เวลาสิ้นสุด

source: other reason
th: เหตุผลเพิ่มเติม

source: total hours
th: จำนวนชั่วโมง

source: incomplete working time
th: เวลาทำงานไม่ครบ

# cantrequestotnormalhours
source: cannot request overtime work during normal working hours.
th: ไม่สามารถขอทำงานล่วงเวลาในเวลาทำงานปกติได้

# cantrequesttoworkhaverecorded
source: you cannot request to work overtime beyond the time frame you have recorded.
th: ไม่สามารถขอทำงานล่วงเวลาเกินกรอบที่ท่านได้บันทึกเวลาทำงานไว้ได้

# cantrequestcompensatenormalhours
source: cannot request compensatory hours during normal working hours.
th: ไม่สามารถขอทำชั่วโมง compensate ในเวลาทำงานปกติได้

# cantrequestcompensatehaverecorded
source: unable to request compensatory hours exceeding the time frame in which you have recorded your working hours.
th: ไม่สามารถขอทำชั่วโมง compensateเกินกรอบที่ท่านได้บันทึกเวลาทำงานไว้ได้

source: search fullname
th: ค้นหาชื่อ-สกุล

source: download working time
th: ดาวน์โหลดเวลาทำงาน

source: download check in-out
th: ดาวน์โหลดการลงเวลา

source: download leaves
th: ดาวน์โหลดการลา

source: show working time
th: แสดงเวลาทำงาน

source: show check in-out
th: แสดงเวลาเข้า-ออกงาน

source: show leaves
th: แสดงการลา

source: weekly holiday
th: วันหยุดประจำสัปดาห์

source: public holiday
th: วันหยุดนักขัตฤกษ์

source: change working time
th: เปลี่ยนเวลาทำงาน

source: weekly in-out time
th: เวลาเข้า-ออกงานรายสัปดาห์

source: summary ot and shift
th: สรุป ot และค่ากะ

source: back
th: ย้อนกลับ

source: next
th: ถัดไป

# paymenttypename
source: payment type
th: ประเภทการจ่าย

source: details shift
th: รายละเอียดกะ

# shiftpaymorning
source: morning shift fee
th: ค่ากะเช้า

# shiftpayafternoon
source: mid shift fee
th: ค่ากะบ่าย

# shiftpaynight
source: night shift fee
th: ค่ากะดึก

# shiftpaytotal
source: total shift fee
th: รวมค่ากะ (บาท)

source: manpower
th: แผนกำลังพล

source: current manpower
th: กำลังพลปัจจุบัน

source: edit manpower
th: แก้ไขแผนกำลังพล

source: edit working time
th: แก้ไขเวลาทำงาน

source: shift management
th: การจัดการกะ

source: shift value
th: ค่ากะ

# dayshift
source: day
th: เช้า

# midshift
source: mid
th: บ่าย

# nightshift
source: night
th: ดึก

source: break time
th: เวลาพัก

source: start break
th: พักในเวลางาน

source: shift type
th: เวลาทำงาน

source: schedule shift patterns
th: จัดรูปแบบกะ

# shiftpatternincorrect
source: the shift pattern is incorrect
th: จัดรูปแบบกะไม่ถูกต้อง

# backtoshiftptternpage
source: go back to the shift pattern page
th: กลับไปหน้าจัดรูปแบบกะ

# exampleshiftschedule
source: example of a shift schedule
th: ตัวอย่างกะ

source: move shift plan
th: ย้ายรูปแบบกะ

source: switch shift
th: สลับกะ

source: shift rotation plan
th: แผนการสลับกะ

source: shift
th: กะ

source: rotate shift patterns
th: สลับรูปแบบกะ

# listshiftemployees
source: list of shift employees
th: รายชื่อพนักงานกะ

# noemplistinshift
source: there are no employees listed in this shift.
th: ไม่มีรายชื่อพนักงานใน shift นี้

source: an error occurred
th: เกิดข้อผิดพลาด

source: incomplete information
th: ข้อมูลไม่ครบ

source: data save successful
th: บันทึกข้อมูลสำเร็จ

source: data save unsuccessful
th: บันทึกข้อมูลไม่สำเร็จ

source: contact admin
th: กรุณาติดต่อผู้ดูแล

source: draft
th: แบบร่าง

source: close accounting period
th: ปิดรอบบัญชี

source: manage salary
th: จัดการเงินเดือน

source: setting
th: ตั้งค่า

source: addition
th: เงินได้สุทธิ

source: salary list
th: รายการเงินเดือน

source: create salary list
th: สร้างรายการเงินเดือน

source: salary import
th: นำเข้าเงินเดือน

source: payrun name
th: ชื่อรายการ

source: period
th: รอบเดือน

source: payment cycle
th: รอบจ่าย

# emptotal
source: Total employees
th: จำนวนพนักงาน

source: total amount
th: ยอดสุทธิ

source: payment date
th: วันที่จ่าย

source: monthly
th: รายเดือน

source: full year
th: ทั้งปี

source: semi-monthly
th: รายครึ่งเดือน

source: payment type
th: รูปแบบการจ่าย

source: daily
th: รายวัน

source: daily and monthly
th: รายวันและรายเดือน

source: payrun type
th: ประเภทรายการ

source: setting data item
th: ตั้งค่ารายการข้อมูล

source: data from system
th: ข้อมูลจากระบบ

source: overtime hours
th: ชั่วโมงล่วงเวลา

source: upload overtime hours
th: อัพโหลดชั่วโมงทำงานล่วงเวลา

source: time
th: เวลา

source: fulltime
th: ประจำ

source: calculate
th: คำนวณ

source: no calculate
th: ไม่คำนวณ

source: calculate by
th: คำนวนโดย

source: consecutive calculation
th: คำนวนต่อเนื่อง

source: each time
th: รายครั้ง

# accumulatecurrentyear
source: Cumulative Income
th: รายได้สะสม

source: upload accumulate current year
th: อัพโหลดรายได้สะสมปีปัจจุบัน

source: please attach file
th: โปรดแนบไฟล์

source: employee documents
th: เอกสารของพนักงาน

source: document name
th: ชื่อเอกสาร

source: document description
th: รายละเอียดเอกสาร

source: category
th: หมวด

# displayhomepage
source: display on the homepage
th: แสดงในหน้าแรก

source: display
th: แสดง

source: not displayed
th: ไม่แสดง

source: edit document name
th: แก้ไขชื่อเอกสาร

source: add document name
th: เพิ่มชื่อเอกสาร

source: more
th: เพิ่มเติม

source: expiration date
th: วันหมดอายุ

source: attach file
th: แนบไฟล์

source: no attached file
th: ไม่มีไฟล์แนบ

source: cc to manager
th: cc ถึงหัวหน้า

source: announcement
th: การประกาศ

source: attached announcement file
th: ไฟล์แนบประกาศ

source: additional document file
th: เอกสารเพิ่มเติม

source: document
th: เอกสาร

source: attached documents
th: เอกสารแนบ

source: summary of leave and late
th: สรุปการลาและมาสาย

source: summary of leave and absences
th: สรุปการลาและขาดงาน

source: summary of probation
th: สรุปทดลองงาน

source: summary contract expire
th: สรุปหมดสัญญา

source: summary of new employees
th: สรุปพนักงานเข้าใหม่

source: summary of resigned
th: รายงานคนลาออก

source: employee information
th: ข้อมูลพนักงาน

source: working time report
th: รายงานเวลาทำงาน

source: report absent
th: รายงานการขาดงาน

source: report late
th: รายงานการมาสาย

# salaryslip
source: pay slip
th: สลิปเงินเดือน

source: government report
th: รายงานราชการ

source: leave report
th: รายงานการลา

source: time stamp report
th: รายงานการลงเวลา

source: request report
th: รายงานการร้องขอ

source: salary adjustment report
th: รายงานปรับเงินเดือน

source: summary diligence allowance
th: สรุปเบี้ยขยัน

source: provident fund report
th: รายงานกองทุนสำรองเลี้ยงชีพ

source: tax deduction report
th: รายงานลดหย่อนภาษี

source: cost element report
th: รายงาน cost element

source: payroll report
th: รายงาน payroll

source: email sent date
th: วันที่ส่ง email

source: select data
th: เลือกข้อมูล

source: select company
th: เลือกบริษัท

source: returned
th: คืนแล้ว

source: haven't returned
th: ยังไม่คืน

source: Time Status
th: สถานะลงเวลา

# didntcheckin
source: Didn't clock in
th: ยังไม่ลงชื่อเข้า

# didntcheckout
source: Didn't clock out
th: ยังไม่ลงชื่อออก

# checkinsu
source: Clock in
th: ลงชื่อเข้าสำเร็จ

# checkoutsu
source: Clock out
th: ลงชื่อออกสำเร็จ

source: Loading...
th: กำลังโหลด...

source: Baht
th: บาท

source: OT and Shift
th: ค่ากะและOT

source: Estimated income for
th: รายได้โดยประมาณ เดือน

source: Calendar
th: ปฏิทิน

source: Month
th: เดือน

source: Year
th: ปี

# notimetowork
source: No Working Hours
th: ไม่มีเวลาทำงาน

source: Shift type holiday
th: วันหยุดชดเชยประเภทกะ

source: Request list
th: รายการคำขอ

source: Select type of request
th: เลือกประเภทคำขอ

source: Start time
th: เวลาที่เริ่ม

source: End time
th: เวลาสิ้นสุด

source: Select hours
th: เลือกชั่วโมง

source: Select minutes
th: เลือกนาที

source: minute
th: นาที

source: hour
th: ชั่วโมง

# timewasenteredincorrectly
source: Incorrect information entered
th: กรอกข้อมูลไม่ถูกต้อง

# unabletomaketransaction
source: Unable to make transactions during normal working hours.
th: ไม่สามารถทำรายการในเวลาทำงานปกติได้

source: Log out
th: ออกจากระบบ

# wantlogout
source: Do you want to log out?.
th: คุณต้องการออกจากระบบหรือไม่ ?

source: phone number
th: เบอร์โทรศัพท์

source: Current address
th: ที่อยู่ปัจจุบัน

# entryandexit
source: Entry and exit time
th: ลงเวลาเข้า/ออก

source: clocking-in
th: บันทึกเวลาเข้างาน

source: clocking-out
th: บันทึกเวลาออกงาน

source: Choose a location
th: เลือกสถานที่

# notinyourworkarea
source: You are not in your work area.
th: คุณไม่ได้อยู้ในพื้นที่ทำงาน

# confirmclockingin
source: Confirm clock-in
th: ยืนยันเวลาเข้างาน

# confirmclockingout
source: Confirm clock-out
th: ยืนยันเวลาออกงาน

source: Approved by
th: อนุมัติโดย

source: No information
th: ไม่มีข้อมูล

source: total
th: รวม

source: Show all
th: แสดงทั้งหมด

# accumulatedincome
source: Cumulative income
th: เงินได้สะสม

# retainedincome
source: Total income
th: รายได้สะสม

# accumulatedwithholdingtax
source: Cumulative withholding tax
th: ภาษีหัก ณ ที่จ่ายสะสม

# accumulatedsocialsecurity
source: Cumulative social security
th: ประกันสังคมสะสม

source: Overview
th: มุมมองภาพรวม

source: Time Attendance
th: เวลาทำงาน

source: Employee
th: พนักงาน

source: Overtime dashboard
th: ข้อมูลค่าล่วงเวลา

source: Attendance Overview
th: ภาพรวมเวลาทำงาน

source: Cost Overview
th: ภาพรวมค่าใช้จ่าย

source: Income and Expenses
th: รายรับรายจ่าย

source: comment
th: ความคิดเห็น

source: No Shift Value
th: ไม่มีค่ากะ

source: Shift Value Exists
th: มีค่ากะ

# startwork
source: Hiring Date
th: เริ่มงาน

source: fetching data...
th: กำลังดึงข้อมูล...

source: B.
th: บ.

source: Accept list
th: รายการรอการอนุมัติ

source: View history
th: ดูประวัติ

source: No items waiting for approval found.
th: ไม่พบรายการที่รอการอนุมัติ

# day
source: days
th: วัน

source: hr.
th: ซม.

source: Login
th: เข้าสู่ระบบ

source: Username
th: ชื่อผู้ใช้

# plsuuser
source: Please enter username.
th: กรุณาใส่ชื่อผู้ใช้

# plsupass
source: Please enter your password.
th: กรุณาใส่รหัสผ่าน

source: Logging in
th: กำลังเข้าสู่ระบบ

# password8characters
source: Password must be at least 8 characters.
th: รหัสผ่านต้องมีอย่างน้อย 8 ตัวอักษร

source: Login successful
th: เข้าสู่ระบบสำเร็จ

source: Username or password is incorrect.
th: ชื่อผู้ใช้ หรือ รหัสผ่าน ไม่ถูกต้อง

source: Loading Data
th: กำลังโหลดข้อมูล

source: Choose a leave frame
th: เลือกกรอบการลา

source: No leave history found
th: ไม่พบประวัติการลา

source: Make a leave list
th: ทำรายการลา

source: Total Leave Days
th: จำนวนวันลา

# thereisnoinformationonleaverights
source: There is no information on leave quota.
th: ไม่มีข้อมูลสิทธิ์การลา

source: Total Days
th: จำนวนวัน

# remainingrights
source: Remaining Quotas
th: สิทธิ์คงเหลือ

# leaverightsarenotenough
source: Leave quota is not enough
th: สิทธิการลาไม่เพียงพอ

# remainingrightsafterrequestingleave
source: Remaining after requested
th: สิทธิคงเหลือหลังขอลา

source: Choose a holiday
th: เลือกวันหยุด

source: Half day
th: ครึ่งวัน

source: Enter Time
th: ระบุเวลา

source: First Half
th: ครื่งแรก

source: Second half
th: ครึ่งหลัง

# mm_dd_yy
source: DD/MM/YY
th: วัน/เดือน/ปี

source: Incorrect date or time
th: วันที่หรือเวลาไม่ถูกต้อง

source: Select all
th: เลือกทั้งหมด

source: Clear all
th: ล้างทั้งหมด

# currentrightsremaining
source: Current remaining quota
th: สิทธิคงเหลือปัจจุบัน

source: Request leave approval
th: ขออนุมัติลา

source: Sending data...
th: กำลังส่งข้อมูล...

source: Leave Transaction Successful
th: ทำรายการลาสำเร็จ

source: There is a repeat request for leave with other items today.
th: มีรายการขอลาซ้ำกับรายการอื่นๆในวันนี้

# verifyyouridentitywithyourIDcardnumber
source: Identity with your ID card number.
th: ยืนยันตัวตนด้วยเลขบัตรประชาชน

source: ID card number is incorrect
th: เลขบัตรประชาชนไม่ถูกต้อง

source: Save starting point
th: บันทึกจุดเริ่ม

source: Save the end point
th: บันทึกจุดสิ้นสุด

source: saved successfully
th: บันทึกสำเร็จ

# pleastryagain
source: please try again
th: กรุณาลองใหม่อีกครั้ง

source: location
th: สถานที่

source: Please enter a note.
th: กรุณากรอกหมายเหตุ

source: additional Notes
th: หมายเหตุเพิ่มเติม

source: travel history
th: ประวัติการเดินทาง

source: Start your journey
th: เริ่มออกเดินทาง

source: end of journey
th: สิ้นสุดการเดินทาง

# enteramileageabeforetravelling
source: Enter mileage before travelling.
th: ใส่เลขไมล์ก่อนเดินทาง

# enterthemileagewhenyoureach
source: Enter the mileage when you reach your destination.
th: ใส่เลขไมล์เมื่อถึงจุดหมาย

source: All
th: ทั้งหมด

# certifyntime
source: Working Time Request
th: ขอรับรอง เวลา

# worknOvertime
source: Overtime Request
th: ขอทำงาน ล่วงเวลา

# timeCompensate
source: Compensate Request
th: ขอทำชั่วโมง Compensate

# requestleave
source: Leave Request
th: ขอลา

source: Language
th: ภาษา

source: to
th: ถึง

# waitforthe1st
source: Pending Review
th: รอผู้อนุมัติลำดับที่ 1 ตรวจสอบ

source: Withdrawal approval date
th: วันที่อนุมัติถอน

source: signing...
th: กำลังลงชื่อ...

source: Signed In Successfully!
th: ลงชื่อสำเร็จ!

source: Salary Total
th: รายจ่ายเงินเดือน

source: OT Total
th: รายจ่ายค่าล่วงเวลา

# pdaywages
source: Pay wages
th: จ่ายค่าแรง

source: Other payments
th: จ่ายอื่นๆ

source: Total payment
th: รวมจ่าย

source: Total wage income
th: รายรับค่าแรงรวม

source: Operating income
th: รายรับค่าดำเนินการ

source: difference
th: ส่วนต่าง

source: leave list
th: รายการลา

source: There is no leave list.
th: ไม่มีรายการลา

source: Male
th: ชาย

source: Female
th: หญิง

source: Average Age
th: อายุพนักเฉลี่ย

source: Average Work
th: อายุงานเฉลี่ย

source: Top 5 Absent
th: 5 อันดับขาดงาน

source: No Absent
th: ไม่มีการขาดงาน

source: OT Total By Type
th: รายจ่ายแยกตามประเภท OT

# timesss
source: Times
th: ครั้ง

source: Person
th: คน

source: Yearly
th: รายปี

# oTOVer36Hr
source: OT Over 36 Hrs.
th: OT เกิน 36 ซม.

# employeeIn
source: Employees
th: เข้าใหม่

source: Employee Out
th: ลาออก

# noEmployeeIn
source: No New Employee
th: ไม่มีพนักงานเข้าใหม่

# noEmployeeOut
source: No Resigned Employee
th: ไม่มีพนักงานลาออก

source: Partner company
th: บริษัทคู่ค้า

source: Date of search
th: วันที่ค้นหา

# name_sur
source: Full name
th: ชื่อ - สกุล

source: Confirm disapproval
th: ยืนยันการไม่อนุมัติรายการ

source: ot time
th: ขอทำงาน ล่วงเวลา

source: withdraw leave
th: ถอนลา

# thereisnoshitlist
source: There is no Shift list
th: ไม่มีรายการคำขอย้ายกะ

source: Confirm time change
th: ยืนยันเปลี่ยนเวลา

# unabletorequestcompensatoryhoursexceeding
source: Unable to request compensatory hours exceeding the time frame in which you have recorded your working hours.
th: ไม่สามารถขอทำชั่วโมง Compensate เกินกรอบที่ท่านได้บันทึกเวลาทำงานไว้ได้

# youcannotrequesttoworkovertimebeyondthetime
source: You cannot request to work overtime beyond the time frame you have recorded.
th: ไม่สามารถขอทำงานล่วงเวลาเกินกรอบที่ท่านได้บันทึกเวลาทำงานไว้ได้

source: List of shifts requests
th: รายการขอย้ายกะ

source: withdraw approve
th: ถอนอนุมัติ

source: department
th: แผนก

source: section
th: ส่วน

source: search
th: ค้นหา

source: Leave Monthly
th: การลางาน รายเดือน

source: Processing fee
th: ค่าดำเนินการ

source: Approve
th: อนุมัติ

source: Reject
th: ไม่อนุมัติ

source: Net pay
th: จ่ายสุทธิ

source: Total Income
th: เงินได้

source: Total Deduction
th: เงินหัก

# downloadsalaryslip
source: Download Pay Slip
th: ดาวน์โหลดสลิปเงินเดือน

source: Account No.
th: เลขที่บัญชี

source: Amount (Baht)
th: จำนวน(บาท)

source: Cumulative Social Security
th: ประกันสังคม

source: Cumulative Provident Fund
th: กองทุนสำรองเลี้ยงชีพสะสม

source: Cumulative Withholding Tax
th: ภาษีหัก ณ ที่จ่ายสะสม

# pleaseFillRequiredInformation
source: Please fill in required information
th: กรุณากรอกข้อมูล

# pleaseFillInTheInformationAccurately
source: Please fill in information accurately
th: กรอกข้อมูลให้ถูกต้อง

source: overtime request
th: คำขอทำงานล่วงเวลา

source: working time request
th: ขอรับรองเวลาทำงาน

source: leave request
th: คำขอลางาน

source: compensate request
th: คำขอทำชั่วโมง compensate

source: degree
th: ระดับ
